html/elisp/operation-objects/text.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>文本</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="operation-objects.html"> UP </a>
 |
 <a accesskey="H" href="../elisp.html"> HOME </a>
</div><div id="content">
<h1 class="title">文本</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org381c923">查看文本属性</a></li>
<li><a href="#orgac7cb01">修改文本属性</a></li>
<li><a href="#org9a49353">查找文本属性</a></li>
</ul>
</div>
</div>
<pre class="example">
文本的插入删除，查找替换操作已经在缓冲区一节中讲过了，这一节主要介绍文本属性

如果使用过其它图形界面的文本组件进行编程，它们对于文本的高亮一般都是采用给对应文本贴上相应标签的方法

Emacs 的处理方法也是类似的，但是相比之下，要强大的多
</pre>

<p>
在 Emacs 里，在 <span class="underline">不同位置上的每个字符</span> 都可以有一个 <span class="underline">属性列表</span> 。 这个属性列表和符号的属性列表很相似，都是由一个 <b>名字和值构成的对</b> 组成：
</p>
<ul class="org-ul">
<li>名字和值都可以是一个 lisp 对象，但是通常名字都是一个 <span class="underline">符号</span> ，这样可以用这个符号来查找相应的属性值</li>
<li>复制文本通常都会 <b>复制</b> 相应的 <span class="underline">字符的文本属性</span> ，但是也可以用相应的函数只复制文本字符串，比如 <span class="underline">substring-no-properties</span> 、 <span class="underline">insert-buffer-substring-no-properties</span> 、 <span class="underline">buffer-substring-no-properties</span></li>
</ul>

<p>
产生一个带属性的字符串可以用 <span class="underline">propertize</span> 函数：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(propertize <span style="color: #deb887;">"abc"</span> 'face 'bold)          <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abc" 0 3 (face bold))</span>
</pre>
</div>

<p>
如果在一个 text-mode 的缓冲区内用 M-x eval-expression 用 insert 函数插入前面这个字符串，就会发现插入的文本已经是粗体字了
</p>

<pre class="example">
  之所以不能在 *scratch* 产生这种效果，是因为通常我们是开启了 font-lock-mode

  在 font-lock-mode 里，文本的 face 属性是实时计算出来的。 在插入文本之后，它的 face 属性已经很快地被改变了

  可以在关闭 font-lock-mode 后再测试一次应该是可以看到 *scratch* 里也是可以用这种方法插入带 face 属性的文本的
</pre>


<p>
虽然文本属性的名字可以是任意的，但是一些名字是有特殊含义的：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> 文本属性</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">属性名</td>
<td class="org-left">含义</td>
</tr>

<tr>
<td class="org-left">category</td>
<td class="org-left">值必须是一个符号，这个符号的属性将作为这个字符的属性</td>
</tr>

<tr>
<td class="org-left">face</td>
<td class="org-left">控制文本的字体和颜色</td>
</tr>

<tr>
<td class="org-left">font-lock-face</td>
<td class="org-left">和 face 相似，可以作为 font-lock-mode 中静态文本的 face</td>
</tr>

<tr>
<td class="org-left">mouse-face</td>
<td class="org-left">当鼠标停在文本上时的文本 face</td>
</tr>

<tr>
<td class="org-left">fontified</td>
<td class="org-left">记录是否使用 font lock 标记了 face</td>
</tr>

<tr>
<td class="org-left">display</td>
<td class="org-left">改变文本的显示方式，比如高、低、长短、宽窄，或者用图片代替</td>
</tr>

<tr>
<td class="org-left">help-echo</td>
<td class="org-left">鼠标停在文本上时显示的文字</td>
</tr>

<tr>
<td class="org-left">keymap</td>
<td class="org-left">光标或者鼠标在文本上时使用的按键映射</td>
</tr>

<tr>
<td class="org-left">local-map</td>
<td class="org-left">和 keymap 类似，通常只使用 keymap</td>
</tr>

<tr>
<td class="org-left">syntax-table</td>
<td class="org-left">字符的语法表</td>
</tr>

<tr>
<td class="org-left">read-only</td>
<td class="org-left">不能修改文本，通过 stickness 来选择可插入的位置</td>
</tr>

<tr>
<td class="org-left">invisible</td>
<td class="org-left">不显示在屏幕上</td>
</tr>

<tr>
<td class="org-left">intangible</td>
<td class="org-left">把文本作为一个整体，光标不能进入</td>
</tr>

<tr>
<td class="org-left">field</td>
<td class="org-left">一个特殊标记，有相应的函数可以操作带这个标记的文本</td>
</tr>

<tr>
<td class="org-left">cursor</td>
<td class="org-left">（不知道具体用途）</td>
</tr>

<tr>
<td class="org-left">pointer</td>
<td class="org-left">修改鼠标停在文本上时的图像</td>
</tr>

<tr>
<td class="org-left">line-spacing</td>
<td class="org-left">新的一行的距离</td>
</tr>

<tr>
<td class="org-left">line-height</td>
<td class="org-left">本行的高度</td>
</tr>

<tr>
<td class="org-left">modification-hooks</td>
<td class="org-left">修改这个字符时调用的函数</td>
</tr>

<tr>
<td class="org-left">insert-in-front-hooks</td>
<td class="org-left">与 modification-hooks 相似，在字符前插入调用的函数</td>
</tr>

<tr>
<td class="org-left">insert-behind-hooks</td>
<td class="org-left">与 modification-hooks 相似，在字符后插入调用的函数</td>
</tr>

<tr>
<td class="org-left">point-entered</td>
<td class="org-left">当光标进入时调用的函数</td>
</tr>

<tr>
<td class="org-left">point-left</td>
<td class="org-left">当光标离开时调用的函数</td>
</tr>

<tr>
<td class="org-left">composition</td>
<td class="org-left">将多个字符显示为一个字形</td>
</tr>
</tbody>
</table>

<pre class="example">
正是由于 emacs 的文本有如此丰富的属性，使得 emacs 里的文字才变得多彩， 变得人性化
</pre>
<div id="outline-container-org381c923" class="outline-2">
<h2 id="org381c923">查看文本属性</h2>
<div class="outline-text-2" id="text-org381c923">
<pre class="example">
    由于字符串和缓冲区都可以有文本属性，所以下面的函数通常不提供特定参数就是检查当前缓冲区的文本属性，如果提供文本对象，则是操作对应的文本属性
</pre>

<p>
查看文本对象在某处的文本属性可以用 <span class="underline">get-text-property</span> 函数 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq foo (concat <span style="color: #deb887;">"abc"</span>
                  (propertize <span style="color: #deb887;">"cde"</span> 'face 'bold))) <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abccde" 3 6 (face bold))</span>

(get-text-property 3 'face foo)                    <span style="color: #5f9ea0; font-style: italic;">; =&gt; bold</span>

(save-excursion
  (goto-char (point-min))
  (insert foo))

(get-text-property 4 'face)                        <span style="color: #5f9ea0; font-style: italic;">; =&gt; bold</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">get-char-property</span> 和 get-text-property 相似，但是它是先查找 overlay 的文本属性
<ul class="org-ul">
<li>overlay 是 <span class="underline">缓冲区文字</span> 在屏幕上的显示方式，它属于某个缓冲区，具有起点和终点，也具有文本属性，可以修改缓冲区对应区域上文本的显示方式</li>
</ul></li>
<li>用 <span class="underline">text-properties-at</span> 可以得到某个位置上文本的所有属性</li>
</ul>
</div>
</div>
<div id="outline-container-orgac7cb01" class="outline-2">
<h2 id="orgac7cb01">修改文本属性</h2>
<div class="outline-text-2" id="text-orgac7cb01">
<p>
<span class="underline">put-text-property</span> 可以给文本对象添加一个属性：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00bfff; font-weight: bold;">let</span> ((str <span style="color: #deb887;">"abc"</span>))
  (put-text-property 0 3 'face 'bold str)
  str)                                  <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abc" 0 3 (face bold))</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">add-text-properties</span> 可以给文本对象添加一系列的属性</li>
<li>可以用 <span class="underline">set-text-properties</span> 直接设置文本属性列表</li>
</ul>
<pre class="example">
(set-text-properties start end nil) 来除去某个区间上的文本属性
</pre>
<ul class="org-ul">
<li>用 remove-text-properties 和 remove-list-of-text-properties 来除去某个区域的指定文本属性</li>
</ul>
<pre class="example">
  这两个函数的属性列表参数只有名字起作用，值是被忽略的
</pre>

<div class="org-src-container">
<pre class="src src-lisp">(setq foo (propertize <span style="color: #deb887;">"abcdef"</span> 'face 'bold
                      'pointer 'hand))
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #("abcdef" 0 6 (pointer hand face bold))</span>
(set-text-properties 0 2 nil foo)       <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
foo   <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abcdef" 2 6 (pointer hand face bold))</span>
(remove-text-properties 2 4 '(face nil) foo) <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
foo   <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abcdef" 2 4 (pointer hand) 4 6 (pointer hand face bold))</span>
(remove-list-of-text-properties 4 6 '(face nil pointer nil) foo) <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
foo   <span style="color: #5f9ea0; font-style: italic;">; =&gt; #("abcdef" 2 4 (pointer hand))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a49353" class="outline-2">
<h2 id="org9a49353">查找文本属性</h2>
<div class="outline-text-2" id="text-org9a49353">
<pre class="example">
    文本属性通常都是连成一个区域的，所以查找文本属性的函数是查找属性变化的位置

    这些函数一般都不作移动，只是返回查找到的位置。使用这些函数时最好使用 LIMIT 参数，这样可以提高效率

    因为有时一个属性直到缓冲区末尾也没有变化，在这些文本中可能就是多余的
</pre>
<ul class="org-ul">
<li><span class="underline">next-property-change</span> 查找从当前位置起任意一个文本属性发生改变的位置</li>
<li><span class="underline">next-single-property-change</span> 查找指定的一个文本属性改变的位置</li>
<li><span class="underline">next-char-property-change</span> 把 overlay 的文本属性考虑在内查找属性发生改变的位置</li>
<li><span class="underline">next-single-property-change</span> 类似的查找指定的一个考虑 overlay 后文本属性改变的位置</li>
</ul>

<pre class="example">
    这四个函数都对应有 previous- 开头的函数，用于查找当前位置之前文本属性改变的位置
</pre>

<div class="org-src-container">
<pre class="src src-lisp">(setq foo (concat <span style="color: #deb887;">"ab"</span>
                  (propertize <span style="color: #deb887;">"cd"</span> 'face 'bold)
                  (propertize <span style="color: #deb887;">"ef"</span> 'pointer 'hand))) <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #("abcdef" 2 4 (face bold) 4 6 (pointer hand))</span>
(next-property-change 1 foo)                  <span style="color: #5f9ea0; font-style: italic;">; =&gt; 2</span>
(next-single-property-change 1 'pointer foo)  <span style="color: #5f9ea0; font-style: italic;">; =&gt; 4</span>
(previous-property-change 6 foo)              <span style="color: #5f9ea0; font-style: italic;">; =&gt; 4</span>
(previous-single-property-change 6 'face foo) <span style="color: #5f9ea0; font-style: italic;">; =&gt; 4</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">text-property-any</span> 查找区域内第一个指定属性值为给定值的字符位置</li>
<li><span class="underline">text-property-not-all</span> 和它相反，查找区域内第一个指定属性值不是给定值的字符位置</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp">(text-property-any 0 6 'face 'bold foo)          <span style="color: #5f9ea0; font-style: italic;">; =&gt; 2</span>
(text-property-any 0 6 'face 'underline foo)     <span style="color: #5f9ea0; font-style: italic;">; =&gt; nil</span>
(text-property-not-all 2 6 'face 'bold foo)      <span style="color: #5f9ea0; font-style: italic;">; =&gt; 4</span>
(text-property-not-all 2 6 'face 'underline foo) <span style="color: #5f9ea0; font-style: italic;">; =&gt; 2</span>
</pre>
</div>

<p>
<a href="file.html">Previous：文件</a>
</p>

<p>
<a href="operation-objects.html">TOP：操作对象</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
